---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptions
source: html/fc592456-e99b-f662-cad1-adad16ac7d19.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptions Property

An element may not reference an element in another Option of the same Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadReferenceBetweenOptions { get; }
```